/*----------------------------------------------------------------
 * 文件名称：台阶-Nim游戏.cpp
 * 创建日期：2021年10月15日 星期五 00时24分32秒 
 * 题 目：AcWing 0892 台阶-Nim游戏 
 * 算 法：博弈论 
 * 描 述：只看奇数台阶石子，就是经典的Nim游戏 
 * 对手拿偶数台阶的石子，那就把刚才拿下的石子再往下拿，
 * 保证奇数台阶的石子数不变
 * 对手拿奇数台阶石子，那就也拿奇数台阶石子，使之异或为零
 *
 ----------------------------------------------------------------*/
#include <cstdio>
int main() {
    int n; scanf("%d", &n);
    int idx = 1;
    int res = 0;
    while (n -- ) {
        int _; scanf("%d", &_);
        if (idx & 1)
            res ^= _;
        idx ++ ;
    }
    if (res)
        puts("Yes");
    else
        puts("No");
    return 0;
}
