/*----------------------------------------------------------------
 *
 *   文件名称：最少硬币问题.cpp
 *   创建日期：2021年03月08日 ---- 14时16分
 *   题    目：硬币问题
 *   算    法：动态规划
 *   描    述：有5种硬币，面值分别为1, 5, 10, 25, 50，数量无限，输入非负整数
 *      表示需要付的钱数，要求付钱时选择最少的硬币数
 *      而且打印出硬币组合
 *      没有硬币数量限制
 *
 ----------------------------------------------------------------*/

#include <cstdio>
const int maxn = 251;
int type[5] = {1, 5, 10, 25, 50};
int dp[maxn];
void solve() {
    dp[0] = 1;
    for (int i = 0; i < 5; ++i)
        for (int j = type[i]; j < maxn; ++j)
            dp[j] = dp[j] + dp[j-type[i]];
}

int main() {
    solve();
    for (int i = 0; i < maxn; ++i)
        printf("dp[%d] = %d\n", i, dp[i]);
    return 0;
}
