/*----------------------------------------------------------------
 *
 *   文件名称：03-生成函数求整数划分.cpp
 *   创建日期：2021年03月13日 ---- 03时33分
 *   题    目：hdu1028
 *   算    法：生成函数
 *   描    述：如果说一定要至少用一张2分的邮票，那就在j循环那里加上
 *      if (k == 3 && j == 0) continue;
 *      以此类推
 *
 ----------------------------------------------------------------*/

#include <cstdio>
const int maxn = 200;
int c1[maxn+1]; //记录展开后第X^n项的系数，即划分n的种类数有c1[n]种
int c2[maxn+1]; //记录临时计算结果
void part() {
    for (int i = 0; i <= maxn; ++i) //初始化，即第一部分(1 + x + x^2 + ...)的系数都是1
        c1[i] = 1, c2[i] = 0;
    /*
     * 从第2部分(1 + x^2 + x^4 + ...)开始展开
     * 也就是说我有面值1分的邮票，有面值2分的邮票，... 有面值200分的邮票，但是面值200分的邮票只有一张
     * 不过也不会题目也不会出到200，因为到123就溢出了
     * 如果题目面值小一点，即可认为邮票是可以重复贴的
     */
    for (int k = 2; k <= maxn; ++k) {
        for (int i = 0; i <= maxn; ++i)
            //k = 2时，i循环第1部分(1 + x + x^2 + ...)，j循环第2部分(1 + x^2 + x^4 + ...)
            for (int j = 0; j + i <= maxn; j += k)
                c2[i+j] += c1[i];
        for (int i = 0; i <= maxn; ++i) {
            c1[i] = c2[i];
            c2[i] = 0;
        }
    }
}

int main() {
    part();
    for (int i = 0; i < 122; ++i)
        printf("%d\n", c1[i]);
    return 0;
}
