/*----------------------------------------------------------------
 * 文件名称：欧拉函数.cpp
 * 创建日期：2021年09月29日 星期三 17时48分21秒 
 * 题 目：AcWing 0873 欧拉函数 
 * 算 法：欧拉函数 
 * 描 述：给定 n 个正整数 ai，请你求出每个数的欧拉函数 
 * 若在算数基本定理中，N = pa1 * pa2 * ... * pam，则：
 *
 *  (N) = N × (p1−1)/p1 × (p2−1)/p2 × … × (pm−1)/pm
 *
 ----------------------------------------------------------------*/

#include <cstdio>
int main() {
    int n; scanf("%d", &n);
    while (n --) {
        int a; scanf("%d", &a);
        int res = a;
        for (int i = 2; i <= a / i; ++ i) {
            if (a % i == 0) {
                res = res / i * (i - 1);
                while (a % i == 0)
                    a /= i;
            }
        }
        if (a > 1)
            res = res / a * (a - 1);
        printf("%d\n", res);
    }
    return 0;
}
