/*----------------------------------------------------------------
 * 文件名称：01.cpp
 * 创建日期：2021年09月29日 星期三 16时35分55秒 
 * 题 目：AcWing 0872 最大公约数 
 * 算 法：欧几里德算法(辗转相除法) 
 * 描 述：给定 n 对正整数 ai, bi，请你求出每对数的最大公约数
 *
 ----------------------------------------------------------------*/

#include <cstdio>
// gcd(a, b) = gcd(b, a mod b)
int gcd(int a, int b) {
    return b ? gcd(b, a % b) : a;
}
int main() {
    int n; scanf("%d", &n);
    while (n --) {
        int a, b;
        scanf("%d %d", &a, &b);
        printf("%d\n", gcd(a, b));
    }
    return 0;
}
