/*----------------------------------------------------------------
 *
 *   文件名称：01-hdu1082-递归求整数划分.cpp
 *   创建日期：2021年03月12日 ---- 11时05分
 *   题    目：hdu1028
 *   算    法：递归
 *   描    述：题目是1 <= n <= 120所以会TLE
 *
 ----------------------------------------------------------------*/

#include <cstdio>
/**
 * 将n划分成最大数不超过m的划分数
 * 比如当n == 4时
 * 划分有5种{1, 1, 1, 1}, {1, 1, 2}, {2, 2}, {1, 3}, {4}
 * 如果有条件限制，比如将4划分成不超过2的划分数
 * 则只有3种{1, 1, 1, 1}, {1, 1, 2}, {2, 2}
 *
 * 不过还是难以置信，怎么想到会有两个参数，难想到
 * 而且想不到通过比较n与m的大小分支
 */
int part(int n, int m) {
    if (n == 1 || m == 1) //结束条件，如果无论n == 1还是m == 1，都只有一种情况
        return 1;
    else if (n < m) //如果n < m也做不到划分比n大的数
        return part(n, n);
    /*
     * 如果n == m，显然有part(n, n-1) + 1
     * +1是因为要不就是划分不超过n - 1的数
     * 要不就是划分等于n的数，而划分等于n的划分{n}只有一种划分
     */
    else if (n == m)
        return part(n, n-1) + 1;
    /*
     * 特殊情况讨论完就是一般情况
     * 划分数中要不就是至少有一个m
     * 要不就是没有m，那么就是m-1
     */
    else
        return part(n-m, m) + part(n, m-1);
}

int main() {
    int n;
    while (scanf("%d", &n))
        printf("%d\n", part(n, n));
    return 0;
}
